// Room: /u/o/onion/room/d_room0.c

#include <room.h>
inherit ROOM;

void create()
{
	set("short", "Ôº×Ó");
	set("long", @LONG
Ôº×ÓÀïµ½´¦ÖÖÂúÁË»¨²Ý,ÓÈÆäÊÇ¸÷Ê½¸÷ÑùµÄ²è»¨,Æ·ÖÖ·±¶à,É«²ÊçÍ·×,ÁîÈËÄ¿²»Ï¾¸ø.
ÕâÀïµÄÖ÷ÈË±Ø¶¨Ê®·ÖÏ²°®²è»¨(flower).
    ¶«±ßÓÐÒ»¶°¾«ÇÉÁ½²ãÂ¥½¨ÖþµÄÐ¡Â¥,ÉÏÍ·»¹µñÁËÒ»Í·ÐÎÌ¬ÉñËÆµÄ·ï»Ë.
    Î÷±ßÓÐÒ»ÉÈÐ¡ºìÃÅ(door).	
LONG
	);
	set("exits", ([ /* sizeof() == 2 */
  "west" : __DIR__"room6",
  "east" : __DIR__"d_room1",
]));
        set("item_desc", ([ /* sizeof() == 1 */
        "flower" : 
"
[1;31m        .-~~-.--.
       :         )
 .~ ~ -.£Ü      /.- ~~ .
 >       .   .'       <
(         [1;33m.- -.        [1;31m )
 - -.-~  - [1;33m-' [1;31m ~-.- -'
   (        :        )         [1;32m  _ _ .-:
   [1;31m ~--.    :    .--~        [1;32m.-~  .-~  }
        [1;31m~-.-^-.-~[1;32m £Ü_      .~  .-~   .~
                 £Ü£Ü'     £Ü'_ _ -~
                  ..    //
         . - ~ ~-.__.-.//
     .-~   . - ~  }~ ~ ~-.~-.
   .' .-~      .-~       :/~-.~-./:
  /_~_ _ . - ~                 ~-.~-._
                                   ~-.<[0m

Äã´ÕÉÏÈ¥×ÐÏ¸µÄÇÆÒ»ÇÆ,·¢ÏÖ´ËµØµÄ²è»¨ÊµÔÚÊÇ¾«Æ·°¡...\n",
	"door" : "Ò»ÉÈ¾«ÇÉµÄÐ¡ºìÃÅ,¿ÉÒÔ´ÓÃÅÖÐ¿´µ½ÁíÒ»±ßµÄ¾°É«.\n",
        ]));
        create_door("west","Ð¡ºìÃÅ","east",DOOR_CLOSED);
                                 
	setup();
}
