// Room: /open/su/room/triggerman.c

inherit ROOM;

void create()
{
	set("short", "ïğ¾Ö´óÃÅ");
	set("long", @LONG
    ÕâÀïÊÇÎäÍşïğ¾Ö,ÊñÖĞµÚÒ»°Ñ½»ÒÎ,ÓÈÆäÊÇÆ°°Ñ×ÓÕÔ¶¦Ìì,Ôø¾­¿¿×ÅÒ»Â·¿ñÄ§±Ş·¨
    É¨Æ½Êñ´¨ÈıÊ®ÁùÕ¯,ÌÖ»ØïğÎï,Ê¹½­ºşÖĞÈËÕğÉã²»ÒÑ.....Ö»Òª°ÑÎïÆ·½»¸øÎäÍşïğ
    ¾Ö,¾Í¿ÉÒÔ¸ßÕíÎŞÓÇ....Èç½ñÔÚÊñÖĞ³ÇÀïµÄÕâ¶°´óÕ¬,ÒÑ¾­³ÉÎª²»¿É»òÈ±µÄÂ·±ê,
    ¿´µ½Ëü,¾ÍÖªµÀÊÇÊñÖĞ³ÇµÄ¶«·½ÁË.....ÃÅÉÏµÄ±â¶îĞ´×Å
[1m    ¡®    Îä       Íş        ïğ       ¾Ö    ¡¯[0m
    Áú·É·ïÎèµÄËÄ×Ö,¾İËµÊÇ½ğµ¶ÃÅÍõ½øËùÌâ,¶«±ß¾ÍÊÇ´óÃÅÁË,Î÷±ßÊÇÊñÖĞµÄÖĞĞÄ¡£
LONG
	);
	set("exits", ([ /* sizeof() == 2 */
//"west" : "/open/su/room/suroad5_10",
  "east" : __DIR__"opening1",
]));

	setup();
}
