// Room: /u/s/sueplan/newplan/area/f10.c
inherit ROOM;

void create ()
{
  set ("short", "[1;37mÔÆÉ½É½ÖĞ[0m");
  set ("long", @LONG
ÄãËæ×ÅÅÌÂÍÉ½¾¶µÇÉÏÔÆÉ½£¬ÂúÑÛÍ¦°Î²ÔËÉ¸ßËÊÈëÔÆ£¬É½·çĞìÀ´ËÉÁÖµÍÒ÷
£¬Í¸×Å¼¸·ÖÈ÷ÍÑÌ©È»£»Â·±ßäıäıµÄÉ½½§£¬ÈçÒ»ãü°×Á·¿î¿îÁ÷¶¯£¬Ë®Éù¶£ßÊÈç
¼ä¹ØİºÓï£¬ÈÃÄãÈÌ²»×¡Ç÷Ç°ŞäÆğÒ»ÅõÒûÏÂ£¬ÇåÙıµÄÉ½ÈªÇßÍ¸ĞÄ·¿£¬ÈÃÄã¾ëÒâ
È«Ïû£¬¾«Éñ¶¶ËÓµØµÇÉÏÉ½Â·¡£
LONG);

  set("outdoors", "/u/s");
  set("exits", ([ /* sizeof() == 2 */
  "south" : __DIR__"f9",
  "north" : __DIR__"f11.c",
]));

  setup();
}
