// Room: /u/s/sueplan/newplan/area/f11.c
inherit ROOM;

void create ()
{
  set ("short", "[1;37mтфи╫и╫жп[0m");
  set ("long", @LONG
дЦкФвеелбми╫╬╤╣гиорютфи╫ё╛бЗяшм╕╟н╡тки╦ъкйхКтфё╛и╫╥ГпЛю╢киаж╣м
рВё╛м╦ве╪╦╥жхВмял╘х╩ё╩и╫жпвРр╧╢╨сЙа╛цЮё╛йВирдЩЁисЙб╤с╗ааё╛╥вбрд╬й╞
жпи╫х╙хТрЧхТож╣ьоРоб╠╪аВё╛х╙к╝ет╪╦жЙд╬ю╪уЩ╥╒╨ЛщЮё╛кьяч╥Г╢╣дЕ╥ш©╙ё╛
спхТйГе╝╫©л╛ё╛аНхкмШ╤ЬиЗгИ║ё
LONG);

  set("outdoors", "/u/s");
  set("exits", ([ /* sizeof() == 3 */
  "east" : __DIR__"f12.c",
  "south" : __DIR__"f10",
  "north" : __DIR__"f15.c",
]));

  setup();
}
