// Room: /u/s/sueplan/newplan/area/room11
inherit ROOM;

void create ()
{
  set ("short", "[1;37mÌìÁº[1;33mĞÇ[0m");
  set ("long", @LONG
    ÉÏÊö¸÷ĞÇ×ùµÄÖ÷ÈË£¬¶¼ÊÇÔÚËÀºó±»Ì«°×½ğĞÇÒÔµ¼ÉÏÌì½çµÄ¡£ÆäÖĞ
Ö»ÓĞÒ»Î»ÔÚÃ»ÓĞËÀÒÔÇ°¾ÍÉÏÌìÈÎÉñµÄ¡£Ëû¾ÍÊÇÖÜ¾üµÄÔªË§ÀîÌìÍõ¡£ÀîÌìÍõ
¾­¹ı°ÙÕ½£¬»¹Ã»ÓĞÕ½ËÀ£¬µ«ÊÇÒòÈ±ÉÙÌìÉñ£¬Ì«°×½ğĞÇ¾Í°ÑÎ´ËÀµÄÀîÌìÍõ´ø
»ØÌì½ç£¬ÇëËûÁô×¤ÓÚÌìÁºĞÇ¡£
LONG);

  set("no_transmit", 1);
  set("exits", ([ /* sizeof() == 2 */
  "out" : __DIR__"room10.c",
  "north" : __DIR__"jroom.c",
]));

  setup();
}
