// Room: /u/s/sueplan/newplan/area/room5
inherit ROOM;

void create ()
{
  set ("short", "[1;37mÌìÍ¬[1;33mĞÇ[0m");
  set ("long", @LONG
ÎäÍõËùÒÔÄÜ¹»ÌÖæû³É¹¦£¬³Æ°ÔÌìÏÂ£¬Ô­ÊÇÍĞ¸¸Ç×ÎÄÍõ¹±Ï×Éõ¶à¡£ºó
À´£¬°ïÖúÎäÍõ£¬ÑïÍşËÄ·½µÄĞí¶à¾üÊ¦£¬½«¾ü¡¢ÖÒ³¼¡¢¶¼ÊÇÎÄÍõËùÆ¸ÓÃµÄ
¡£¾ÍÊÇËµ£¬ÎÄÍõÉÆÓÚµ÷ºÍÈÚºÏ£¬Ê¹²¿ÊôÃÇÖÒĞÄ°®¹ú¡£ËùÒÔËäÈ»È»×³Ö¾Î´
³ê£¬µ«ÎÄÍõÈ¥ÊÀºó£¬Ì«°×½ğĞÇ±ãÇëËûµÄÁé»êÓÀÁô¡®ÌìÍ¬ĞÇ¡¯£¬ÕÆ¹Ü¡®ÈÚ
ºÏ¡¯ºÍ¡®ÎÂË³¡¯¡£

LONG);

  set("no_transmit", 1);
  set("light_up", 1);
  set("exits", ([ /* sizeof() == 2 */
  "out" : __DIR__"room4.c",
  "north" : __DIR__"room6.c",
]));

  setup();
}
