// Room: /u/s/sueplan/newplan/area/room9
inherit ROOM;

void create ()
{
  set ("short", "[1;37mÌ°ÀÇ[1;33mĞÇ[0m");
  set ("long", @LONG
µ±ÒóÉÌ¼õÍö£¬æ§¼ºÒ²±»½ªÉĞËù²¶¶ø´¦ËÀ£¬Ì«°×½ğĞÇÕÙÀ´æ§¼ºµÄÁé»ê
£¬ÈÃËıÓÀ×¡Ì°ÀÇĞÇ£¬ÕÆ¹Ü¡®ÓûÍû¡¯¡£æ§¼º±¾À´ÊÇ¸öºüÀêÑı¾«£¬ÏÕ¼éÓÖ½Æ
»«£¬ÊÇ²»Ó¦¸Ã±»·îÎªÅ®ÉñµÄ¡£µ«ÊÇµ±Ê±Ìì½çÉÙÉñ£¬ËùÒÔ¸øµØÒ»¸öÅ®ÉñµÄ
ÉñÎ»¡£
    Ì«°×½ğĞÇÓÖÅÂËı×ö³öĞí¶àº¦ÈËµÄÊÂ£¬ËùÒÔÌØµØÑ¡ÔñÓÉĞ×ÀÇËùÎ§×¡µÄ
Ì°ÀÇĞÇ×÷Îª ­µÄÓÀ×¡µØµã£¬²»ÈÃËı×ß³öÍâÃæ£¬¿É¼ûÌ«°×½ğĞÇÔçÓĞÏÈ¼ûÖ®
Ã÷¡£
LONG);

  set("no_transmit", 1);
  set("exits", ([ /* sizeof() == 2 */
  "out" : __DIR__"room8.c",
  "north" : __DIR__"room10.c",
]));

  setup();
}
