// Room: /u/s/sueplan/newplan/area/room1
inherit ROOM;

void create ()
{
  set ("short", "[1;37mвоч╠[1;33mпг[0m");
  set ("long", @LONG
╡╝рькЫв║╣д║╝вои╚╣дг╬ч╠т╟║╞ё╛Ёфн╙║╝пУч╠пг║╞║ёртуБвоч╠пгн╙жВё╛
мфкЦхк╣дцЭа╛ё╛уБ╥╫╥╗  ╫пвЖвоч╠╤╥йЩ╩Рвоч╠мфцЭйЩ║ё 
        воч╠пгтзмфцЭйЩжпуф╧э║╝вП╧С║╞ё╛╨орБн╙ифа╪╦ъ╧С║ё
    ╩ь╣╫жэ©╓бДндмУё╛йдлЛ╦╢ЁПё╛е╛а╕яЬбМа╥╠Ь║ё╣╚йгеб╣де╛а╕ипн╢╢О
╣╫д©╣дё╛кШ╣д╡║кю║ё╡╝рь╣д╣э╣э╪лЁп╦╦мУ╣дреж╬ё╛а╒н╙нДмУё╛лАЁ╚е╘╦Ш
ё╛я╣а╥╠Ьй©ё╛╦╩╧Зм╬г©ё╛╡╒гр╣ц╣╫р╩╦Жн╟╢С╣д╬Эй╕╫╙ипё╛╤Ь╢Р╟эрС╬Эё╛
╪УмЖрСил║ёнДмУкЫртдэ╧╩╢Р╣╧ФШмУё╛Ёф╟тлЛобё╛╫╗а╒жэЁ╞ё╛©иртк╣мЙх╚
╣ца╕сз╢С╬Эй╕╫╙ип║ё       
LONG);

  set("no_transmit", 1);
  set("light_up", 1);
  set("exits", ([ /* sizeof() == 1 */
  "north" : __DIR__"room2.c",
]));

  setup();
}
