// Room: /u/s/sueplan/newplan/area/room2
inherit ROOM;

void create ()
{
  set ("short", "[1;37mÌì»ú[1;33mĞÇ[0m");
  set ("long", @LONG
½ªÉĞÓÖÃû½ª×ÓÑÀ£¬¾Ó×¡ÓÚÀ¥ÂØÉ½µÄÉîÉ½Àï£¬ÏòÔªÊ¼Ìì×ğÑ§Ï°ÏÉµÀ£¬
»ñµÃÉõ¶àµÄÖÇ»Û¡£ÔËÆøÎ´µ½ÒÔÇ°£¬ÎŞÂÛÄÄÒ»¸öÓ¢ĞÛ¡¢ÏÍÕÜ¡¢¾üÊ¦¶¼ºÍ·²
ÈËÍêÈ«Ò»Ñù¡£½ªÉĞµ½ÀÏÄêÒ»Ö±¹ı×Å»³²Å²»ÓöµÄÉú»î¡£ËûµÄ²»ĞÒ£¬¿ÉÒÔËµ
ÊÜµ½ÁËÅäÅ¼µÄÓ°Ïì¡£ÒòÎªËûºÍÒ»Î»ĞÕÂíµÄĞ¡½ã½á»é£¬ËùÒÔÒ»±²×Ó³àÆ¶Èç
Ï´¡£µ«ÊÇµ½ÁËÀÏÄê£¬ËûÁ©±Ë´ËÍ¬ÒâÀë»é£¬¸÷×ß¸÷ÈËµÄÂ·¡£´ÓÄÇ¸öÊ±ºòÆğ
£¬½ªÉĞ²Å¿ªÊ¼×ßÁËºìÔË¡£ËûÃ¿ÌìÒ»ÈËÔÚºş±ß´¹µö£¬Å¼¶ø±»ÎÄÍõ·¢ÏÖËûµÄ
²ÅÄÜ£¬ÈÎÖÜ¹ú¾üÊ¦¡£½ªÉĞÒ»Ïò°®¹úÖÒÍõ£¬ÎÄÍõËÀºóÒ²ÈÔÈ»¸¨×ôÎäÍõ£¬½ß
Á¦Ç¿¹ú¸»¹ú¡£ÒòÎªËûµÄÖÇ»Û¹ıÈË£¬¿ÉÒÔÔ¤²âÎ´À´£¬ÊÊÓ¦ÏÖÔÚ£¬ËùÒÔËû²Å
±»ÈÎÃüÎªÖÜÈÕµÄ¾üÊ¦¡£                                                   ÎäÍõ³Æ°ÔÌìÏÂÒÔºó£¬½ªÉĞÊÜ·âÎªÆë¹úÖîºî£¬²»¼¸ÄêËûÖÕÓÚÊÅÊÀ
ÁË£¬ËûµÄÁé»ê±»Ì«°×½ğĞÇĞ¯»ØÌì½ç£¬ÓÀ×¡ÓÚÌì»úĞÇ¡£´Ó´Ë£¬Ìì»úĞÇÕÆ¹Ü
×ÏŞ±¶·ÊıÖĞµÄ¡®ÖÇ»Û¡¯¡£ 
LONG);

  set("objects", ([ /* sizeof() == 1 */
  "/open/scholar/room/newplan/npc/scholar_kao.c" : 1,
]));
  set("light_up", 1);
  set("no_transmit", 1);
  set("exits", ([ /* sizeof() == 2 */
  "enter" : __DIR__"room3.c",
  "south" : __DIR__"room1.c",
]));

  setup();
}
int valid_leave(object me, string dir)
{
  if(dir=="enter"&&present("scholar",environment(me)))
    {
    return notify_fail("Äã·¢¾õÓĞÈËµ²ÔÚÄãÃæ, ²»ÈÃÄã¹ı!!!\n");
     }
  return 1;
}
