#include <ansi.h>

inherit ROOM;
string show_word(object me);

string *great = ({
               "        ╧ййбяЩ╬╚©╙╫╡├╙....  "NOR, 
            HIY"    вН╨Сж╝цн╩ц╢╚к╣©╙й╪~~~~~ "NOR,
            HIW" ф╞ф╞СЦА╟цюц╪сплЛвъб╥въ╣╫═слО..."NOR,
            HIW" рРн╙л╚юаак,╡╩оКфПю╢, ╣╚йг╦п╬У╣╫спжжрЛяЫяш╧Б©╢векЩ"NOR,
            HIW" dean╣дп╟╤ЯяшиЯ╡╩╤ове©╢векЩ, ©зк╝╤╪©ЛаВЁЖю╢ак..:D~~"NOR,
            HIW" dean╢С╨╟ : нрр╙╫ыи╚ !! ╦Ьнрмя~~~~~~"NOR,
            HIW" Anmy рт╢©╫Ю╣дяшиЯ©╢веп║╤В╤В, оКак╨ц╬ц╨ц╬ц.... "NOR,
            HIW" dean╤Я╨щ╨щ╣д╣ивекЩ, кф╨УоЯ╢Ср╟юг╟Цр╩©зЁтобА╟А╟.. "NOR,
            HIW" ╢кй╠цЯвЕ..╣д╬хпг ╡╩~Mud╣дфФ╡еLum╣гЁ║...." NOR,
            HIC"     ╧Б ц╒ кд иД    иа иа ╤╞ хк       "NOR,
            HIW" п║ю╜д╥©╢веп║╤В╤В, ╤Чхккф╨Ур╩╢╔╢Щ╥╒, р╩╣╘╤╞йж.."NOR,
            HIW" ╫╚йф╠ьйг р╩й╠╧╢╤╞лЛюв╣ь╩П р╩╥╒╡╩©ийуй╟ !!! "NOR,
            HIG"                 ©ийг... "NOR,
            HIW" п╟╤Яп║╤В╡╩мё╣ь©╢веп║ю╜д╥иооб╨э╤Ю╢н, ╨цкфоКвей╡ц╢.."NOR,
            HIW"                          to be continue... "NOR,
});

void create ()
{
  set ("short", "[1;35m╧Щх╔й╠©у[0m тА╫ём╓");
  set ("long", @LONG

дЦожтзю╢╣╫р╩╦Жи╫яЭ©©╫Эи╫╤╔╣дм╓всё╛м╓всг╟а╒вер╩╦Жа╫уи╤Ю╦ъ╣д
й╞╠╝(monolith)ё╛╢см╓всюОт╤лВ╠╠╥╫а╛цЮ╡╩╬║╣д╢Си╫ё╛й╧дЦ╡╩╫Ш╦п╣╫пь
рэж╝╪Др╩╧ис╒пшгИ╩Ёсмх╩╤ЬиЗё╛тА╫ём╓╬щк╣ц©╣╫одхур╧мМё╛р╟╥Г╢╣╧Щё╛
╩А╡ЗиЗр╩уСуСньнь╣д©чфЭиЫё╛уБр╡йгк╝ялй╝╬╟жп╣д║╦╧бм╓╫ёфЭ║╠║ёЁЖак
м╓всё╛мЫдо╠Цйгж╠м╗╨Гл╗╣дй╞╫в║ё

LONG);

  set("exits", ([ /* sizeof() == 1 */
  "east" : __DIR__"path2",
]));
  set("item_desc", ([ /* sizeof() == 2 */
  "word" : " тздЦяшг╟кф╨Успхкрт╩К╨Я╣ддза╕╫╚р╩п╘©лвж
ртиЁ╦╡╦г╧Щх╔ , оКр╙©╢гЕЁЧ , ©идэ╣ц╩╗╣ЦфЬа╕ ..
",
  "monolith" : "й╞╠╝иоаЗ╥и╥ОнД╣ь©лве╪╦╦Ж╢Свжё╨

    ╥Г╡╗╫ёиЯюХ╨Лр╘г╟╠╡тА╫ёсз╢кё╛к╝ял╦С╣зкд╢ЗфъЁ╓юо╠хнД
    ╡╩й╓ё╛рт╪И╪ф╨╕хк╤Ьвтх║фДхХё╛нДуъ╫т╡╩ЁщфДп║хкпп╬╤ё╛
    ╨оа╕╩Ви╠сз╢кё╛╪вЁ╫дЙа╒╢км╓йИцЗфДйбртн╙╨СхкрС╪Ь║ё
                        ╣зхЩ╢Зк╝ял╦СжВ сзю╪ц╣рТ
                        ╣зкд╢Зк╝ял╦СжВ дТ    ят   ╨оа╒
                        ╣знЕ╢Зк╝ял╦СжВ ╤н ╟ь и╫

     дЦрЧрЧ╣д©╢╣╫й╞╠╝╣дср╨С╢╕кф╨Удё╨Щ╣ьп╢ак╪╦╦Жвж ...
",
]));
  set("objects", ([ /* sizeof() == 1 */
  __DIR__"npc/executioner" : 1,
]));

  setup();
}
void init()
{
   add_action("start_great","show");
}
int start_great()
{
  call_out("show_great",1,this_player(),0);
  return 1;
}
int show_great(object me,int x)
{
   int i;
   string msg;
   msg = great[x];
   message_vision(msg+"\n",me);
   if( ++x < sizeof(great) ) {
             call_out("show_great", 1 ,me,x);
    }
}
