// room7.1 by roger
inherit ROOM;
#include <ansi.h>
void create () {
set ("short","test");
   set ("long",@LONG
                                          "HIY"  ®ç®é
                                            "HIY"®Ä "HIB" °°°°°°®ç
  °°°°"HIW"®ç®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä"HIB"®Ä®Ä®Ä®Ä®Ä®~
  °°"HIW"®ç®Ä®~®~®~®~®}®}®}®|®|®|®{®{®z®z®z"HIR"°Ú°Ú°Ú"HIB"®Ä®Ä®Ä®Ä®Ä®è
                                            "HIY"®Ä
                                          "HIY"®ç®è"NOR"


     "HIG"®ç®}®}®é        "HIW"®ç®Ç"HIY"®Ä®Ä®Å®Ä®Ä®~®}®|®{®z®y®x
     "HIG"®É®Ä®}®Ç®Ç®Ç®Ç®Ç"HIW"®É"HIB"°Ú"HIY"®Ä®Ä®Ä®~®~®Ä®Ä®Ä®~®~®Ä®Ä®Ä®é
     "HIG"®ê ®è           "HIW"®ê®Ç              "HIW""BBLU"®~®}®|®{®z®y®x"NOR""HIY"®é"NOR"
"HIB"
    £ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ£ﬂ
  ®ç®Ä®è£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ø®á
®ç®Ä®è£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ω£Ø¶ı®á
®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä¶ı¶ı®á
®Ä®Ä®Ä°ı®è              °ı®Ä°ı             °ı®Ä°ı               ®ê°ı®Ä¶ı¶ı®á
®Ä®Ä°ı°Ò                  °Û                 °Û                   °Ò°ı¶ı¶ı®á
®Ä®Ä®è®q®T®T®T®T®T®T®T®T           ®U                     ®U        ®ê¶ı¶ı®á
®Ä®Ä®á®U                     ®T®T®T®p®T®T®T®r     ®U      ®U      ®U®ä¶ı¶ı®á
®Ä®Ä®á®d®T®T®T®T®T®T®T®r   ®T®T®T®T®p®T®T®T®p®T   ®t®T®T®T®m®T®T®T®s®ä¶ı¶ı®á
®Ä®Ä®á®U              ®U     ®T®T®T®p®T®T®T®s     ®T®h®T®T®T®T®T®T®T®ä¶ı¶ı®á
®Ä®Ä®á®U              ®U       ®T®T®p®T®T         ®q®s              ®ä¶ı¶ı®á
®Ä®Ä®á®U              ®U     ®T®T®T®m®T®T®T     ®q®s®T®T®T®T®T®T®T®r®ä¶ı¶ı®á
®Ä®Ä®á®d®T®T®T®T®T®T®T®s   ®q®T®T®T®T®T®T®T®r   ®s®U              ®U®ä¶ı¶ı®á
®Ä®Ä®á®U                   ®d®T®T®T®T®T®T®T       ®U              ®U®ä¶ı¶ı®á
®Ä®Ä®é®t®T®T®T®T®T®T®T®T   ®t®T®T®T®T®T®T®T®s     ®t®T®T®T®T®T®T®T®s®ç¶ı¶ı®á
®Ä®Ä°ı°Ò                  °Û                 °Û                   °Ò°ı¶ı¶ı®á
®Ä®Ä®Ä°ı®é              °ı®Ä°ı             °ı®Ä°ı Roger & Falcon®ç°ı®Ä¶ı£Ø
®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä®Ä£Ø
"NOR"
LONG);

        set("evil", 1);
        set("no_auc", 1);
        set("no_transmit", 1);
        set("light_up",-1);      

        setup();
}
