// Room: /u/f/fire/room/room1-5.c
inherit ROOM;
#include <ansi.h>
#include <marksman.h>
void create ()
{
  set ("short", "[1;34mÕÅ¼ÒÌúÆÌ[2;37;0m");
  set ("long", @LONG
Äã×ß½øÒ»¼ä³äÂúÈÈÆøµÄ·¿×ÓÖĞ£¬ÕâÀïÊÇ³¤É³³Ç×î´óµÄ´òÌúÆÌ£¬ÔÚ
·¿¼äµÄÖĞÑëÓĞÒ»¿Ú¸ßÓĞËÄ³ßµÄ´ó»ğÂ¯£¬ºìºìµÄ»ğÑæ´ÓÂ¯ÖĞ²»¶ÏµÄÃ°³ö
¡£ÔÚ»ğÂ¯ÖĞÔòÓĞĞí¶àÒÑ¾­ÉÕºìµÄÌú¿é¡£ÔÚ»ğÂ¯µÄÅÔ±ßÔòÊÇÒ»¸×ºÃ´óµÄ
ÇåË®¡£·¿ÄÚµÄÌú½³ÕıÔÚ¸ÏÖÆÒ»Á÷µÄÎäÆ÷£¬Äã¿ÉÒÔÔÚÕâÑ¡³öÒ»Á÷µÄÎäÆ÷
À´Ê¹ÓÃ¡£
ÏëÖªµÀÕâÀïÓĞÄÇĞ©ÎäÆ÷¿ÉÒÔÑ¡ÓÃµÄ»°ÇëÓÃ(view)À´²é¿´!!!
LONG);

  set("exits", ([ /* sizeof() == 1 */
  "south" : __DIR__"room1-4",
]));

  set("objects", ([ /* sizeof() == 1 */
C_NPC"/chang-sen" : 1,
]));
  setup();
}
