inherit ROOM;
void create() {
	set( "short", "[1;33m¹í¸«Éñ¹¬[0m" );
	set( "exits", ([
		"southwest" : "/open/clan/ou-cloud-club/room/room309.c",
		"enter"     : "/open/clan/ou-cloud-club/room/room314",
	]) );
	set( "long", @LONG
±ùÀäµÄºşË®ÈÃÄãµÄÊÖ½ÅÓĞµã²»ÌıÊ¹»½£¬µ«ÇóÉúµÄÔ­Ê¼±¾
ÄÜÈ´ÈÃÄã²»×Ô¾õµÄ»®¶¯ÊÖ½ÅÇ°½ø£¬ÂıÂıµÄÒ²ÄÜÊÊÓ¦¶øÔÚÆäÖĞ
ÓÆÓÎ£¬»·¹ËËÄÏÂ£¬³ıÁËÑô¹âÍ¸¹ıË®ÃæµÄĞ©Î¢¹âÏßÖ®Íâ£¬ºşµ×
¾¡ÊÇÒ»Æ¬²»¿É²âµÄ²ÒÂÌ£¬Å¼¶øÒ»Ğ¡ÈºÓÎÓã´ÓÄãÉíÅÔÓÎ¹ı£¬È´
²»ÒòÎªÄãµÄÍ»È»³öÏÖ¶øÓĞËù¾ªÏÅ£¬ËãÁË£¬»¹ÊÇ¿ìÕÒ³ö¿Ú°É¡£
¡õ
LONG);
	setup();
	replace_program(ROOM);
}
