inherit ROOM;
void create() {
	set( "short", "[1;36mнчял╨Ч[0m" );
	set( "exits", ([
		"north"     : "/open/clan/ou-cloud-club/room/room309",
		"out"       : "/open/clan/ou-cloud-club/room/room307.c",
	]) );
	set( "long", @LONG
╠ЫюД╣д╨Чк╝хцдЦ╣дйж╫есп╣Ц╡╩лЩй╧╩╫ё╛╣╚гСиЗ╣дт╜й╪╠╬
дэх╢хцдЦ╡╩вт╬У╣д╩╝╤╞йж╫ег╟╫Ьё╛бЩбЩ╣др╡дэййс╕╤ЬтзфДжп
сфснё╛╩╥╧ккдобё╛ЁЩакяТ╧Бм╦╧Щк╝цФ╣дп╘н╒╧Боъж╝мБё╛╨Ч╣в
╬║йгр╩ф╛╡╩©и╡Б╣д╡рблё╛е╪╤Ьр╩п║х╨снсЦ╢сдЦиМетсн╧Щё╛х╢
╡╩рРн╙дЦ╣дм╩х╩ЁЖож╤ЬспкЫ╬╙оеё╛кЦакё╛╩╧йг©ЛурЁЖ©з╟и║ё
║У
LONG);
	setup();
	replace_program(ROOM);
}
