// Room: /u/d/dhk/questsfan/rm10
inherit ROOM;
#include <ansi.h>
void create ()
{
  set ("short", "[1;33mÈÕÈÕ[1;32m¸ÊÁØ[0m");
  set ("long", @LONG
Õâ¶ùÊÇÒ»×ùÊ÷ÖÖ·±ÔÓ£¬¸ß´óµÄÊ÷ÁÖ¡£µ«ÊÇÕâ×ùÊ÷ÁÖ×î´óµÄÌØÉ«
È·ÊÇÃ»ÓĞÒ»¿ÌÍ£Ö¹µÄĞ¡Óê£¬ËùÒÔÕâ×ùÊ÷ÁÖµÄ±ğ³Æ¾Í½Ğ£¢ÈÕÈÕ¸ÊÁØ¡å
¡£´«ËµÕâ¶ùÈÕÈÕ²»Í£µÄÓêÊÇÒòÎªÓêÉñÓĞÒ»´ÎÔÚ´ËµØĞİÏ¢£¬ÒòÎªÌ«ÈÈ
ËùÒÔÈÃ´ËµØÏÂÒ»³¡Ğ¡Óê£¬µ«ÊÇËûĞİÏ¢ÍêÈ´´Ò´ÒÀëÈ¥£¬¾¹Ã»ÓĞÈÃÕâ³¡
ÓêÍ£Ö¹¡£ËùÒÔ´Ó´ËÕâÀïµÄÓê±ãÃ»Í£¹ı¡£

LONG);

  set("objects", ([ /* sizeof() == 1 */
  __DIR__"npc/man" : 2,
]));
  set("outdoors", "/u/d");
  set("exits", ([ /* sizeof() == 4 */
  "westdown" : __DIR__"rm9",
  "westup" : __DIR__"rm17",
  "eastup" : __DIR__"rm11",
  "northup" : __DIR__"rm18",
]));

  setup();
}
