// Room: /u/d/dhk/questsfan/rm28
inherit ROOM;
#include <ansi.h>
void create ()
{
  set ("short", "²Ø[1;35mÏÉ¹È[2;37;0m");
  set ("long", @LONG
ÕâÀïÊÇáÔÉ½×îÓĞÃûµÄ£¢áÔÉ½Ë«¹È¡åÖ®Ò»£¬ÓĞ×Å¡®ÏÉÈË¹ÊÏç¡¯µÄÑÅ
³ÆµÄ²ØÏÉ¹È¡£¾İÒ»Ğ©½­ºşÒ¥´«£¬ÈôÊÇĞŞµÀÖ®ÈËÔÚ½«½üµÃµÀ³ÉÏÉÖ®Ç°ÄÜ
Ç°Íù´Ë¹ÈĞŞĞĞ¡¢¾Ó×¡Ò»¶ÎÊ±ÈÕ±ãÄÜÁ¢¼´µÃµÀ³ÉÏÉ¡£²»¹ıÄã×ĞÏ¸ÏòËÄÖÜ
´òÁ¿Ò»·¬£¬·¢¾õ´ËµØÖ»²»¹ıÊÇÒ»×ùÆÕÍ¨µÄÉ½¹È£¬¶¥¶àÊÇ»·¾³ÂÔÎªÓÅÑÅ
¡¢ÇåĞÂÒ»µã°ÕÁË£¬ÊµÔÚ¿´²»³öËüµÄÌØ±ğÔÚºÎ´¦£¬ÊµÔÚÁîÈËÄÉÃÆÑ½£¡

LONG);

  set("objects", ([ /* sizeof() == 1 */
  __DIR__"obj/stone1.c" : 1,
]));
  set("outdoors", "/u/d");
  set("no_transmit", 1);
  set("exits", ([ /* sizeof() == 2 */
  "east" : __DIR__"rm33",
  "west" : __DIR__"rm31",
]));

  setup();
}
