// Room: /u/d/dhk/questsfan/room27
inherit ROOM;
#include <ansi.h>
void create ()
{
  set ("short", "[0;37mºç¾§[5m[1;36m»ãÁéµØ[2;37;0m");
  set ("long", @LONG
ÄãÒ»½øÈë¶´Ñ¨µÄÍ¬Ê±£¬ºö¾õ»ª¹âÍòµÀºÃËÆ¶´ÍâµÄ¾°
ÖÂÉ«²Ê¶¼±»ÎüÄÉ¡¢Å¨Ëõµ½ÁËÕâ¶ùÒ»°ã¡£ÕâÀïµÄ¾§Ê¯ËùÍ¸
ÉäÉ¢·¢³öµÄ¹âÃ¢¾ÍÈçÍ¬¹ÈÍâÄÇ×ù¾§ÇÅÒ»Ñù¡£µ«Ô¸Õâ¶ùµÄ
¾§Ê¯È·ºÃËÆ¸½ÓĞÄ§Á¦Ò»°ãÒıÏì×ÅÄã¡£ÔÚÕâ¶ùÓĞÈçÌÉÎÔÔÚ
Ñô¹âÏÂ°ãµÄÎÂÅ¯£¬±ùÁ¹µÄÎ¢·çĞìĞìµÄ´µ·÷×ÅÄã£¬µ«ÊÇ´Ë
µØÃ÷Ã÷ÊÇ¹Èµ×Ñ½£¿Ôõ»áÓĞÈç´ËÏÖÏó¡­

LONG);

  set("exits", ([ /* sizeof() == 1 */
  "out" : __DIR__"room26",
]));
  set("objects", ([ /* sizeof() == 1 */
  __DIR__"obj/stone.c" : 1,
]));
  set("no_transmit", 1);
  set("no_clean_up", 1);

  setup();
}
