// Room: /u/d/dhk/questsfan/room20
inherit ROOM;
#include <ansi.h>
void create ()
{
  set ("short", "[0;37m╩р[0m╬╖╡Ц");
  set ("long", @LONG
уБр╩╡Цн╩сз╧х╪Д╣д╫А╬╖╤╪ЁйожрЬи╚╣д╧Бц╒ё╛кЫрт╧кцШ
к╪рЕуБр╩╡Ц╣д╫А╬╖╫пё╒рЬ╬╖й╞ ║Её╛фДр╚яш╣д╧Бц╒╥╒и╒кджэ
ты╪сио╡╩й╠иак╦╣душиД╬╖╧Бё╛мПхТр╩ф╛нч╪й╣дрЬ╨с╟Цё╛еД
╨овепг╧Б╩циДвесухкд©╧Б╣дм╪╩╜║ёаМдЦ╨Ж╬У╡╩ййё╛ж╠хон╙
дЦ╡╩с╕ыТДб╢кй╔╣ь║ёдЦр╩б╥╧ш©╢╧Щясм╬р╩╡Ц╡Ц╦Вй╫╦Ви╚╣д
╬╖й╞ё╛аМдЦ╦п╣╫жбиМсзои╬Ёжп╣д╦п╬У║╒яш╩╗ацбрё╛╨Ж╤Ь╨ц
╪╚╨Ж╤ЬсТцф║╜╠Д╣д╤ЮЁНиф╦п║ё

LONG);

  set("outdoors", "/u/d");
  set("no_transmit", 1);
  set("exits", ([ /* sizeof() == 2 */
  "southdown" : __DIR__"room21",
  "northup" : __DIR__"room19",
]));

  setup();
}
