// Room: /u/d/dhk/questsfan/room19
inherit ROOM;
#include <ansi.h>
void create ()
{
  set ("short", "[1;35m×Ï[0m¾§²ã");
  set ("long", @LONG
ÕâÒ»²ãÎ»ÓÚ¹È¼äµÄ½á¾§¶¼³ÊÏÖ×ÏÉ«µÄ¹âÃ¢£¬¶øÕâÒ»²ã
µÄ½á¾§ÓĞÒ»ÌØ±ğµÄÃû³Æ£¢»Ê¾§Ê¯ ¡å£¬ÒòÎª¹Å´ú×ÏÉ«¾ÍÓĞ×Å
´ú±í»ÊµÛµÄ¼«×ğ¡¢È¨¹óµÄÉ«Ôó¡£ÁíÄãºö¾õ²»ÊÊ£¬Ö±ÈÏÎªÄã
²»Ó¦ÙôäÂ´ËÊ¥µØ¡£ÄãÒ»Â·¹Û¿´¹ıÑÓÍ¾Ò»²ã²ã¸÷Ê½¸÷É«µÄ¾§
Ê¯£¬ÁíÄã¸Ğµ½ÖÂÉíÓÚÏÉ¾³ÖĞµÄ¸Ğ¾õ¡¢ÑÛ»¨ÁÃÂÒ£¬ºö¶øºÃ¼«
ºö¶øÓôÃÆ¡­±äµÄ¶à³îÉÆ¸Ğ¡£

LONG);

  set("outdoors", "/u/d");
  set("no_transmit", 1);
  set("exits", ([ /* sizeof() == 2 */
  "eastup" : __DIR__"room18",
  "southdown" : __DIR__"room20",
]));

  setup();
}
