// Room: /u/d/dhk/questsfan/room17
inherit ROOM;
#include <ansi.h>
void create ()
{
  set ("short", "[1;34mÀ¶[0m¾§²ã");
  set ("long", @LONG
ÕâÒ»²ãÎ»ÓÚ¹ÈÔµµÄ½á¾§¶¼³ÊÏÖÀ¶É«µÄ¹âÃ¢£¬ËùÒÔ¹ËÃû
Ë¼ÒåÕâÒ»²ãµÄ½á¾§½Ğ£¢À¶¾§Ê¯ ¡å£¬ÒòÆäÑÕÉ«ìÅÀ¶ÇÒÎŞÊ±ÎŞ
¿ÌµÄÉ¢·¢³öÁíÈËÓÇÓôµÄÆøÏ¢£¬»áÁíÄãÏëÆğÄãÒ»ÉúµÄ´ìÕÛ£¬
ĞÄÇéÓôÃÆ¡£ÄãÒ»Â·¹Û¿´¹ıÑÓÍ¾Ò»²ã²ã¸÷Ê½¸÷É«µÄ¾§Ê¯£¬Áí
Äã¸Ğµ½ÖÂÉíÓÚÏÉ¾³ÖĞµÄ¸Ğ¾õ¡¢ÑÛ»¨ÁÃÂÒ£¬ºö¶øºÃ¼«ºö¶øÓô
ÃÆ¡­±äµÄ¶à³îÉÆ¸Ğ¡£

LONG);

  set("outdoors", "/u/d");
  set("no_transmit", 1);
  set("exits", ([ /* sizeof() == 2 */
  "westdown" : __DIR__"room18",
  "eastup" : __DIR__"room16",
]));

  setup();
}
