// Room: /u/d/dhk/questsfan/room15
inherit ROOM;
#include <ansi.h>
void create ()
{
  set ("short", "[1;33m»Æ[0m¾§²ã");
  set ("long", @LONG
ÕâÒ»²ãÎ»ÓÚ¹ÈÔµµÄ½á¾§¶¼³ÊÏÖ½ğÉ«µÄ¹âÃ¢£¬ËùÒÔ¹ËÃû
Ë¼ÒåÕâÒ»²ãµÄ½á¾§½Ğ£¢½ğ¾§Ê¯ ¡å£¬´ÌÑÛµÄ½ğÃ¢ÈÃÄã¿ìÈÃÄã
Õö²»¿ªÑÛ¾¦£¬ËÄÖÜÃÔÂş×ÅÒ»¹É¹óÆø£¬Ê¹Äã²úÉúÒ»¹É²»¿ÉÒ»
ÊÀµÄ°ÔÆø¡£ÄãÒ»Â·¹Û¿´¹ıÑÓÍ¾Ò»²ã²ã¸÷Ê½¸÷É«µÄ¾§Ê¯£¬Áí
Äã¸Ğµ½ÖÂÉíÓÚÏÉ¾³ÖĞµÄ¸Ğ¾õ¡¢ÑÛ»¨ÁÃÂÒ£¬ĞÄÇé¶ÙÊ±¿ªÀÊĞí
¶à¡£

LONG);

  set("outdoors", "/u/d");
  set("no_transmit", 1);
  set("exits", ([ /* sizeof() == 2 */
  "westdown" : __DIR__"room16",
  "southup" : __DIR__"room14",
]));

  setup();
}
