// Room: /u/d/dhk/questsfan/room25
inherit ROOM;
#include <ansi.h>
void create ()
{
  set ("short", "Ô²[1;33m¾§[0m²ã");
  set ("long", @LONG
ÕâÒ»ÇøµÄ½á¾§ÒÀÈ»Ã»ÓĞÑÕÉ«£¬µ«ÊÇÈ´·Ç³£ÌØ±ğµÄÂú
µØ¾ùÊÇÒ»¿Å¿Å»ëÔ²ÌŞÍ¸£¬¹â»¬ÓĞÖÂµÄÔ²¾§£¬Èô´ËÊ±ÓĞÁí
Ò»¶ÑÊÀ½çÉÏ×î°ô£¬ÆÀ¼Û×î¸ßµÄµÄÕäÖéÓëÖ®Ïà±È¡£ÈÔ»áÑ·
É«Ğí¶à¡£ÕâÕıÊÇÉÆ¼¯ÌìÏÂÆæÕäÒì±¦µÄÌìÌÃÑ½£¡Èç¹ûÌìÌì
ÔÚ´ËÓëÕâĞ©Ô²¾§¶ÔÍû£¬¶¼²»»á¸Ğµ½Ñá·³ÄØ£¡ÈôÓ²ÒªĞÎÈİ
Ëü£¬ÄÇÎÒÖ»ÄÜÓÃ£¢Àö¡åÕâÒ»¸ö×ÖÀ´ĞÎÈİ¡£

LONG);

  set("outdoors", "/u/d");
  set("no_transmit", 1);
  set("exits", ([ /* sizeof() == 2 */
  "south" : __DIR__"room24",
  "westup" : __DIR__"room26",
]));

  setup();
}
