// bank.c

inherit BANK;

void create ()
{
  set ("short", "[1;35m¹ıÈ¥Ê±¿Õ[0m °²¼ÇÇ®×¯");
  set ("long", @LONG
ÕâÊÇÒ»¼äËØÀ´ÒÔ¹«Æ½ĞÅÓÃÖø³ÆµÄÇ®×¯£¬Ç®×¯µÄÀÏ°å»¹ÊÇ¸öÔø¾­ÖĞ¹ı
¾ÙÈËµÄ¶ÁÊéÈË£¬Äã¿ÉÒÔ¿´µ½Ç®×¯ÀïÀïÍâÍâ¶¼´òÉ¨µÃ¸É¸É¾»¾»£¬Ò»¸öÅÖÅÖ
µÄÖĞÄêÈË×øÔÚ¹ñÌ¨ºóÃæ£¬¹ñÌ¨ÉÏ·Å×ÅÒ»¿éÅÆ×Ó(sign)£¬Íù¶«ÊÇÍ¨ÍùÑ©Í¤
Õò´ó½ÖµÄ´óÃÅ¡£
LONG);

  set("exits", ([ /* sizeof() == 1 */
  "east" : __DIR__"mstreet1",
]));
  set("item_desc", ([ /* sizeof() == 1 */
  "sign" : "ÕâÀïÊÇÇ®×¯£¬Ä¿Ç°ÎÒÃÇÌá¹©µÄ·şÎñÓĞ£º

convert     ¶Ò»»Ç®±Ò¡£

",
]));
  set("no_fight", 1);
  set("no_magic", 1);

  setup();
}
