// inn.c


inherit ROOM;

string look_sign(object me);

void create ()
{
  set ("short", "[1;35m╧Щх╔й╠©у[0m рШ╥Г©му╩");
  set ("long", @LONG
дЦожтзуЩу╬тзя╘м╓уРдо╠ъ╣др╩╪рп║©му╩юОё╛уБ╪р©му╩кДп║ё╛х╢йг╥╫т╡
нЕ╟ыюОдзвН╦╨й╒цШ╣др╩╪рё╛©му╩╣джВхк╬щк╣йгр╩н╩тфснкд╨ё╣доихкё╛хГ╧Ш
дЦ╣д╦ёт╣иН╨Я╣д╩╟ё╛р╡пМ©ирттзуБюОсЖ╣╫кШ║ёЁЩ╢кж╝мБё╛ю╢вт╦В╣ь╣дбцхк
╤╪о╡╩╤╬ш╪╞тзуБюО╫╩╩╩бцм╬ио╣д╪Шнеё╛дЦр╡©ирттзуБюО╢РлЩ╣╫пМ╤Юспх╓╣д
оШо╒║ё©©╫Эце©з╣д╣ь╥╫спр╩©Инзд╬╣ЯЁи╣дупеф(sign)║ё
LONG);

  set("exits", ([ /* sizeof() == 2 */
  "up" : __DIR__"inn_2f",
  "east" : __DIR__"square",
]));
  set("item_desc", ([ /* sizeof() == 1 */
  "sign" : (: look_sign :),
]));
  set("valid_startroom", 1);

  setup();
}

string look_sign(object me)
{
	if( wizardp(me) )
		return "упефп╢веё╨рШ╥Г©му╩║ёет╠ър╩ееп║вжё╨в╞к╪яфлБ║ё\n";
	else
		return "упефп╢веё╨рШ╥Г©му╩║ё\n";
}
