// Room: /d/snow/mstreet1.c

inherit ROOM;

void create ()
{
  set ("short", "[1;35m¹ıÈ¥Ê±¿Õ[0m Ñ©Í¤Õò½ÖµÀ");
  set ("long", @LONG
ÄãÏÖÔÚÕı×ßÔÚÑ©Í¤ÕòµÄ½ÖµÀÉÏ£¬¶«±ß²»Ô¶´¦ÓĞÒ»¼ä¸ß´óµÄÔº×Ó£¬ÃÅ
¿ÚÁ¢×ÅÒ»¸ù´Ö´óµÄÆì¸Ë£¬Æì×ÓÉÏĞ´×Å¡¸´¾·çÎä¹İ¡±£¬ÍùÄÏÖ»ÌıµÃÈËÉù¶¦
·Ğ£¬ÊÇ¸öÎåÊ®³ß¼û·½µÄ¹ã³¡£¬ÈËÀ´ÈËÍùÏàµ±ÈÈÄÖ¡£Íù±±¿ÉÍû¼ûÒ»×ùÅÆ·»
£¬Äê´ú¾ÃÔ¶£¬ÉÏÃæµÄ×Ö¼£ÔçÒÑ¿´²»³öÊÇÊ²Ã´×Ö£¬³öÁËÅÆ·»¾ÍÊÇÕòÍâ¡£
LONG);

  set("exits", ([ /* sizeof() == 4 */
  "north" : __DIR__"mstreet2",
  "south" : __DIR__"square",
  "west" : __DIR__"bank",
  "east" : __DIR__"school1",
]));
  set("outdoors", "snow");

  setup();
}
