// Room: /d/snow/mstreet4.c

inherit ROOM;

void create ()
{
  set ("short", "[1;35m¹ıÈ¥Ê±¿Õ[0m Ñ©Í¤Õò½ÖµÀ");
  set ("long", @LONG
ÕâÀïÊÇÑ©Í¤ÕòµÄ´ó½Ö£¬Ò»ÌõĞ¡Ïï×ÓÍ¨Íù¶«±ß£¬Î÷±ßÔòÊÇÒ»¼äæäÕ¾£¬
ÓÉÓÚÑ©Í¤ÕòÀ´ÍùµÄÉÌÂÃ¡¢¹ÙÔ±²¢²»ºÜ¶à£¬Òò´ËËäÈ»ÊÇ¹Ù¸®µÄæäÕ¾£¬Ò²½Ó
ÊÜ°ÙĞÕµÄĞÅ¼ş£¬´ó½ÖÍù±±ÊÇÒ»´¦É½Ûê£¬´ÓÕâÀïÔ¶Ô¶µØ¿ÉÒÔÍû¼û±±·½µÄÒ°
ÑòÉ½£¬³öÁËÉ½Ûê¾ÍÊÇÒ»ÌõËéÊ¯Â·Í¨ÍùÉ½ÉÏ¡£
LONG);

  set("exits", ([ /* sizeof() == 3 */
  "west" : __DIR__"postoffice",
  "south" : __DIR__"mstreet3",
  "north" : __DIR__"crossroad",
]));

  setup();
}
