// Room: /d/snow/postoffice.c

inherit ROOM;

void create ()
{
  set ("short", "[1;35m¹ıÈ¥Ê±¿Õ[0m Ñ©Í¤æä");
  set ("long", @LONG
ÕâÀïÊÇ¸ºÔğÑ©Í¤Õò¹Ù¸®ÎÄÊé¸ú¾üÁîÍùÀ´µÄÑ©Í¤æä£¬µ«ÊÇÒòÎª³öÁËÑ©
Í¤ÕòÍù±±µÄÒ°ÑòÉ½½üÄêÀ´ÓĞµÁ·ËÅÌ¾İ£¬¹Ù¸®µÄĞÅ²î×î½ü¶¼¸Ä×ß¶«±ßµÄ·É
ğ°Õ»µÀ£¬ËùÒÔÑ©Í¤æäÀ´ÍùµÄÈË¾ÍÉÙÁË£¬æäÕ¾µÄ¹ÙÔ±Ë÷ĞÔ¾Í¿ªÊ¼½ÓÒ»Ğ©°Ù
ĞÕµÄĞÅ¼ş£¬Ò»·½Ãæ´ò·¢Ê±¼ä£¬Ò»·½ÃæÒ²ÓĞµãÊÂ×öÒÔÃâ±»ÉÏ¼¶²Ã³·¡£æäÕ¾
´óÃÅ¿ÚÉÏĞü×ÅÒ»¿éÄ¾ÅÆ(sign)£¬ÉÏÃæĞ´ÁËĞ©×Ö¡£
LONG);

  set("exits", ([ /* sizeof() == 1 */
  "east" : __DIR__"mstreet4",
]));
  set("item_desc", ([ /* sizeof() == 1 */
  "sign" : "ÅÆ×ÓÉÏĞ´µÀ£º
    ·îÇÇÒõ¸®ÖªÏØÁîÓ÷£¬±¾æä×ÅÈÕÆğÊÕ·¢ÊÂÒËÀ©¼°¹ÙÔ±°ÙĞÕÉÏÏÂÈË
µÈÍ¨°ì£¬¹ÙÔ±¼°±ø²¿¸Ã¹Ü¾üÊ¿¡¢¹Ù¸®ÑÃÒÛÃâ·Ñ£¬Ò»°ãÁ¼Ãñ°ÙĞÕÊéĞÅ
ÊÕ·ÑÃ¿Í¨Ê®ÎÄ£¬ÊÕĞÅÃâ·Ñ£¬ÎïÆ·ÊÕ·ÑÒÀ·İÁ¿´óĞ¡Áí¼Æ£¬¹óÖØÏ¸ÈíÌÈ
ÓĞÒÅÊ§ÍË·Ñ¼ÓÎå³ÉÅâ³¥£¬²»µÃÒìÒé¡£
",
]));
  set("objects", ([ /* sizeof() == 1 */
  __DIR__"npc/post_officer" : 1,
]));

  setup();
}

int valid_leave(object me, string dir)
{
	object mbox;

	if( mbox = me->query_temp("mbox_ob") ) {
		tell_object(me, "Äã½«ĞÅÏä½»»ØæäÕ¾¡£\n");
		destruct(mbox);
	}
	return 1;
}
